Repository: lowell-dashboard/dashboard-flask
Catalog: lowell-dashboard/app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Page not found
es: Página no encontrada

source: Go to the Home Page
es: Ir a la página de inicio

source: Lowell News
es: Lowell Noticias

source: Lowell Schedules
es: Horarios Lowell

source: Lowell Textbooks
es: Libros de texto de lowell

source: Lowell Help Forum
es: Foro de ayuda de Lowell

source: Login
es: Iniciar sesión

source: Report Bugs
es: Informar de errores

source: © Lowell-Dashboard Github Organization. All Rights Reserved.
es: © Lowell-Dashboard Organización Github. Todos los derechos reservados.

source: View License
es: Ver licencia
